/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_exit.c                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: hkong <hkong@student.42seoul.kr>           +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/01/10 16:25:01 by daejlee           #+#    #+#             */
/*   Updated: 2023/01/11 12:54:54 by hkong            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "built_in.h"

/**
 * @brief 
 * 빌트인 exit 함수입니다. 옵션을 지원하지 않습니다.
 * original : exit [n]
 * @return int exit_status
 */
int	ft_exit(void)
{
	exit(0);
}
